app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "email", "first_name", "last_name", "age", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "about" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-10-16 23:20:54.108742"], ["about", "If you see something that moves you"], ["id", 1]]
---
  def update
    @user=User.find(params[:id])

    if @user.update(user_params)