backend/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Testing-123"], ["LIMIT", 1]]
---
    def self.find_by_credentials(credential, password)

        if credential.match(URI::MailTo::EMAIL_REGEXP)
            user = User.find_by(email: credential)
        else
            user = User.find_by(username: credential)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2022-10-09 19:35:35.734493"], ["id", 1]]
---
    def reset_session_token!
        self.update!(session_token: generate_unique_session_token)

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_unique_session_token
        token = SecureRandom.base64

        while User.exists?(session_token: token)